[
  {
    "id": 1,
    "date": "September 12, 2023",
    "title": "HTML & CSS: The ABC of Front-End Development",
    "introduction": "HTML and CSS are considered the ABC of front-end development. They are fundamental technologies used to create and style web pages. HTML (Hypertext Markup Language) provides the structure and content of a web page, while CSS (Cascading Style Sheets) is used for styling and layout",
    "paragraph1": "Paragraph 1",
    "image1": "Link to image 1",
    "paragraph2": "Paragraph 2",
    "image2": "Link to image 2",
    "paragraph3": "Paragraph 3",
    "image3": "Link to image 3"
  },
  {
    "id": 2,
    "date": "July 12, 2023",
    "title": "Rudiments of Music",
    "introduction": "Rudiments are necessary basics to the knowledge of the theory of music and useful in practical sight-reading of musical notes on the staff.  These rudiments include musical notes and sound, rhythm, timing and duration of notes, accidentals, building of chords, intervals between notes, and dynamics. Rudiments of music are fundamental to creating melodies and block of extensive chords/harmonies.",
    "paragraph1": "Paragraph 1",
    "image1": "Link to image 1",
    "paragraph2": "Paragraph 2",
    "image2": "Link to image 2",
    "paragraph3": "Paragraph 3",
    "image3": "Link to image 3"
  },
  {
    "id": 3,
    "date": "December 12, 2023",
    "title": "ReactJs: A Powerful Tool for Web Development",
    "introduction": "React is a JavaScript library developed by Facebook which, among other things, was used to build Instagram.com. It aims to allow developers to create fast user interfaces for websites and applications alike easily.",
    "paragraph1": "Paragraph 1",
    "image1": "Link to image 1",
    "paragraph2": "Paragraph 2",
    "image2": "Link to image 2",
    "paragraph3": "Paragraph 3",
    "image3": "Link to image 3"
  },
  {
    "id": 4,
    "date": "August 12, 2023",
    "title": "NextJS: An Improvement to React",
    "introduction": "Next.js is a React framework that gives you building blocks to create web applications. By framework, we mean Next.js handles the tooling and configuration needed for React, and provides additional structure, features, and optimizations for your application.",
    "paragraph1": "Paragraph 1",
    "image1": "Link to image 1",
    "paragraph2": "Paragraph 2",
    "image2": "Link to image 2",
    "paragraph3": "Paragraph 3",
    "image3": "Link to image 3"
  }
]
